# Shell & prompt
brew "zsh"
brew "antidote"
brew "starship"

# CLI essentials
brew "fzf"
brew "zoxide"
brew "direnv"
brew "fd"
brew "bat"
brew "eza"
brew "ripgrep"
brew "jq"

# Git
brew "git"
brew "gh"
brew "lazygit"

# Editor / multiplexer / runtime mgr
brew "neovim"
brew "tmux"
brew "mise"

# Kubernetes
brew "kubernetes-cli"
brew "kubectx"

# Bootstrap
brew "chezmoi"
